title: Shared Webroot
status: stable
description: 'Advesaries may place a webshell on a fileshare and execute that webshell by accessing it on an existing website. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: SOC Prime Team
tags:
  - attack.lateral_movement
  - attack.t1051
logsource:
  product: zeek
  service: smb_files
detection:
  selection:
    path|contains:
      - 'inetpub'
      - 'wwwroot'
  short_name:
    name|re: '.*[^a-zA-Z0-9\.\_\-][a-zA-Z0-9\.\_\-]{1,3}\.[A-Za-z0-9]{2,3}$'
  extensions:
    name|endswith:
      - '.aspx'
      - '.asp'
      - '.php'
      - '.jsp'
      - '.jspx'
      - '.war'
      - '.ashx'
      - '.asmx'
      - '.ascx'
      - '.asx'
      - '.cshtml'
      - '.cfm'
      - '.cfc'
      - '.cfml'
      - '.wss'
      - '.do'
      - '.action'
      - '.pl'
      - '.plx'
      - '.pm'
      - '.xs'
      - '.t'
      - '.pod'
      - '.php-s'
      - '.pht'
      - '.phar'
      - '.phps'
      - '.php7'
      - '.php5'
      - '.php4'
      - '.php3'
      - '.phtml'
      - '.py'
      - '.rb'
      - '.rhtml'
      - '.cgi'
      - '.dll'
      - '.ayws'
      - '.cgi'
      - '.erb'
      - '.rjs'
      - '.hta'
      - '.htc'
      - '.cs'
      - '.kt'
      - '.lua'
      - '.vbhtml'
  condition: selection AND (extensions OR short_name)
level: low