title: Potentially Harmful Attachment
description: 'Advesaries may send malicious attachments via email. These are files that normally, for legitimate purposes, will not be sent. Especially from an external email. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: SOC Prime Team
tags:
 - attack.initial_access
 - attack.t1193
logsource:
 product: zeek
 service: files
detection:
  selection:
    source: 'SMTP'
    name|endswith:
      - '.7z'
      - '.ace'
      - '.apm'
      - '.app'
      - '.appref-ms'
      - '.arj'
      - '.asp'
      - '.bas'
      - '.bat'
      - '.bz2'
      - '.bzip2'
      - '.cab'
      - '.cdxml'
      - '.cer'
      - '.chi'
      - '.chm'
      - '.chq'
      - '.chw'
      - '.class'
      - '.cmd'
      - '.cnt'
      - '.com'
      - '.cpl'
      - '.crt'
      - '.doc'
      - '.docm'
      - '.epub'
      - '.exe'
      - '.gadget'
      - '.gz'
      - '.gzip'
      - '.hta'
      - '.img'
      - '.inf'
      - '.ins'
      - '.ins'
      - '.iso'
      - '.isp'
      - '.isp'
      - '.jar'
      - '.jar'
      - '.jnlp'
      - '.jse'
      - '.lnk'
      - '.lzh'
      - '.mde'
      - '.mht'
      - '.msi'
      - '.msix'
      - '.msixbundle'
      - '.ods'
      - '.odt'
      - '.pif'
      - '.pkg'
      - '.pl'
      - '.ps1'
      - '.ps1xml'
      - '.ps2'
      - '.ps2xml'
      - '.psc1'
      - '.psc2'
      - '.psd1'
      - '.psd1'
      - '.psdm1'
      - '.psm1'
      - '.pssc'
      - '.py'
      - '.pyc'
      - '.pyo'
      - '.pyw'
      - '.pyz'
      - '.pyzw'
      - '.r01'
      - '.r14'
      - '.r18'
      - '.r25'
      - '.rar'
      - '.reg'
      - '.scr'
      - '.sct'
      - '.shb'
      - '.sys'
      - '.tar'
      - '.taz'
      - '.tbz'
      - '.tbz2'
      - '.tgz'
      - '.txz'
      - '.udl'
      - '.vbe'
      - '.vbs'
      - '.ws'
      - '.wsb'
      - '.wsc'
      - '.wsf'
      - '.xbap'
      - '.xls'
      - '.xlsm'
      - '.xpi'
      - '.xz'
      - '.z'
      - '.zipx'
  condition: selection
falsepositive:
  - 'legitimate attachments shared between power users such as an iso file.'
level: low