title: Possible DNS exfiltration
status: test
description: 'This rule identifies possible data exfiltration through DNS'
author: Will LaForest
logsource:
  product: zeek
  service: dns
detection:
  single:
    - uid: C93Ohi4w6CSyxU2C6g
  condition: single