title: Multiple Windows Remote Registry Service Connections
description: 'Detects multiple remote connections to the Windows registry. Although this may legitimately happen, it should be rare for this to be done on multiple remote computers. If the threshold of more than 10 computers is too low, you change the 10 within the condition to a number such as 15 or 20 or whatever fits your needs. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: SOC Prime Team
tags:
  - attack.lateral_movement
  - attack.t1021
  - attack.t1021.002
logsource:
  product: zeek
  service: dce_rpc
detection:
  selection:
    endpoint: 'winreg'
  timeframe: 15m
  condition: selection | count (id_resp_h) by id_orig_h > 10
falsepositive:
  - 'Unknown'
level: medium
fields:
  - ts
  - id.orig_h
  - id.orig_p
  - id.resp_h
  - id.resp_p
  - endpoint
  - named_pipe
  - operation
  - uid